{"posts":[{"title":"random quote generator","text":"IntroductionReact is one of powerful frontend frameworks when it comes to state management. Developed by Meta (former Facebook), React have an in-built state object which seamlessly manages display of your webapp according to interactions with your application. in this project I used React to generate random quotes from an API as the user clicks on the button. the webapp is hosted for free on heroku.","link":"/Projects/random-quote-generator/"},{"title":"Hello World","text":"Welcome to my Blog! this is my first Post. My name is Iphigenie Bera and I can’t wait to share my knowledge, learning journey and bits of my life here. I am currently pursuing my Undergraduate degree in Computer Science at Northwestern University with a minor in Data science and Engineering. I was born and raised in Rwanda before coming in the USA for my studies. I am interested in everything data: data engineering, data science, data analytics and software engineering. I believe in the power of data in making sound decisions and optimizing resources. I will post articles about my computer science journey in articles. you can look at my resume from navigation bar resume. I will document by projects with code snippets and demos, if applicable in projects. Feel free to browse my posts my tags tags or categories or track past post in the archives. you can reach out to me on Github or linkedIn.","link":"/Other/hello-world/"}],"tags":[{"name":"React","slug":"React","link":"/tags/React/"},{"name":"heroku","slug":"heroku","link":"/tags/heroku/"},{"name":"Introduction","slug":"Introduction","link":"/tags/Introduction/"},{"name":"Hello World","slug":"Hello-World","link":"/tags/Hello-World/"}],"categories":[{"name":"Projects","slug":"Projects","link":"/categories/Projects/"},{"name":"Other","slug":"Other","link":"/categories/Other/"}],"pages":[{"title":"","text":"Iphigenie Bera who am IMy name is Iphigenie Bera, and I am an Undergraduate Computer Science student at Northwestern University, USA. I worked at Meta(former Facebook) as data engineering intern and worked as a Research Assistant at Northwestern University. My study and work interests mainly are in the areas of machine learning, artificial intelligence, general computer science, data engineering and software engineering. I am a MOOC courses junkie, so I consume a couple of courses on Coursera, FreecodeCamp, Youtube and Udemy to supplement my college courses. Before joining Computer Science program, I was in Mechanical Engineering my first college year where I picked up engineering analysis skills and feel in love with programming from MATLAB analysis and decided to join Computer Science, the rest is history. InterestsI am a data-first person. I first ensure data quality of data and identify insights from data. I advocate for responsible data science practices by addressing bias associated with data processes.From Healthcare, infrastructure planning, finance, media and all the way to digital intergration with physical systems,I am interested in design of data intensive systems, enforcing better data governance, agility and resourcefulness. HobbiesI love flowers and wouldn’t be ashamed to take picture of flowers in public [ I might make a big dataset out of my flowers collection, who knows:) ]. I like to watch Korean dramas and listen to BTS, so I am casual Korean learner.","link":"/about/index.html"}]}